iNavFlight/inav/lib/main/STM32H7/Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_sd.c
  if(Instance == 0UL)
  {
    ret = MX_SDMMC1_SD_Init(&hsd_sdmmc[Instance]);
  }
  else
  {
    ret = MX_SDMMC2_SD_Init(&hsd_sdmmc[Instance]);
  }

  return ret;
}
/**
  * @brief  SD EXTI line detection callbacks.
  * @retval None
  */
static void SD_EXTI_Callback(void)
{
   uint32_t sd_status;

  if (HAL_GPIO_ReadPin(SD_GPIO_PORT[0], (uint16_t)PinDetect[0]) == GPIO_PIN_SET)
  {
    sd_status = SD_NOT_PRESENT;
  }
  else
  {
    sd_status = SD_PRESENT;
  }
  BSP_SD_DetectCallback(0, sd_status);
  if (HAL_GPIO_ReadPin(SD_GPIO_PORT[1], (uint16_t)PinDetect[1]) == GPIO_PIN_SET)
  {
    sd_status = SD_NOT_PRESENT;
  }
  else
  {
    sd_status = SD_PRESENT;
  }
  BSP_SD_DetectCallback(1, sd_status);
}

/**
  * @brief  Initializes the SD MSP.
  * @param  hsd  SD handle
  * @retval None
  */
static void SD_MspInit(SD_HandleTypeDef *hsd)
{
  GPIO_InitTypeDef gpio_init_structure;

  if(hsd == &hsd_sdmmc[0])
  {
    /* Enable SDIO clock */
    __HAL_RCC_SDMMC1_CLK_ENABLE();

    /* Enable GPIOs clock */
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();

    /* Common GPIO configuration */
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Pull      = GPIO_PULLUP;
    gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;

    /* GPIOC configuration */
    gpio_init_structure.Alternate = GPIO_AF12_SDMMC1;
    gpio_init_structure.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
    HAL_GPIO_Init(GPIOC, &gpio_init_structure);

    /* GPIOD configuration */
    gpio_init_structure.Alternate = GPIO_AF12_SDMMC1;
    gpio_init_structure.Pin = GPIO_PIN_2;
    HAL_GPIO_Init(GPIOD, &gpio_init_structure);

    /* NVIC configuration for SDIO interrupts */
    HAL_NVIC_SetPriority(SDMMC1_IRQn, BSP_SD_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(SDMMC1_IRQn);

  }
  else if(hsd == &hsd_sdmmc[1])
  {
#if (USE_BSP_IO_CLASS > 0)
    BSP_IO_Init_t  io_init_structure;
#endif

    /* Enable SDIO clock */
    __HAL_RCC_SDMMC2_CLK_ENABLE();
    /* Enable GPIOs clock */
    __HAL_RCC_GPIOG_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    SD_LDO_SEL_GPIO_CLK_ENABLE();

    /* Common GPIO configuration */
    gpio_init_structure.Mode      = GPIO_MODE_AF_PP;
    gpio_init_structure.Pull      = GPIO_NOPULL;
    gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio_init_structure.Alternate = GPIO_AF11_SDMMC2;
    /* GPIOC configuration, D0, D1*/
    gpio_init_structure.Pin = GPIO_PIN_9 | GPIO_PIN_10;
    HAL_GPIO_Init(GPIOG, &gpio_init_structure);

    /* GPIOC configuration,  D2, D3*/
    gpio_init_structure.Alternate = GPIO_AF10_SDMMC2;
    gpio_init_structure.Pin =  GPIO_PIN_11 | GPIO_PIN_12;

    HAL_GPIO_Init(GPIOG, &gpio_init_structure);

    /* GPIOD configuration, CK ,CMD line */
    gpio_init_structure.Pin = GPIO_PIN_6 | GPIO_PIN_7;
    gpio_init_structure.Alternate = GPIO_AF11_SDMMC2;
    HAL_GPIO_Init(GPIOD, &gpio_init_structure);

#if (USE_BSP_IO_CLASS > 0)
    /* Enable 3V3 and 1V8 SW */
    io_init_structure.Pin  = IO_PIN_0 | IO_PIN_8;
    io_init_structure.Pull = IO_PULLUP;
    io_init_structure.Mode = IO_MODE_OUTPUT_PP;

    (void)BSP_IO_Init(0, &io_init_structure);
    (void)BSP_IO_WritePin(0, IO_PIN_0, IO_PIN_RESET);  /* 3.3V sw : Off */
    (void)BSP_IO_WritePin(0, IO_PIN_8, IO_PIN_RESET);  /* 1.8V sw : Off */
    HAL_Delay(200);
    (void)BSP_IO_WritePin(0, IO_PIN_0, IO_PIN_SET); /*3.3 SW*/
    (void)BSP_IO_WritePin(0, IO_PIN_8, IO_PIN_SET); /*1.8V SW*/
#endif

    /* SD_LDO_SEL ; 3.3V/1.8V switch */
    gpio_init_structure.Pin     = SD_LDO_SEL_PIN;
    gpio_init_structure.Mode    = GPIO_MODE_OUTPUT_PP;
    gpio_init_structure.Pull    = GPIO_PULLDOWN;
    gpio_init_structure.Speed   = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(SD_LDO_SEL_GPIO_PORT, &gpio_init_structure);

    /* NVIC configuration for SDIO interrupts */
    HAL_NVIC_SetPriority(SDMMC2_IRQn, BSP_SD_IT_PRIORITY, 0);
    HAL_NVIC_EnableIRQ(SDMMC2_IRQn);
  }
  else
  {
    /* Do nothing */
  }
}

/**
  * @brief  DeInitializes the SD MSP.
  * @param  hsd  SD handle
  * @retval None
  */
static void SD_MspDeInit(SD_HandleTypeDef *hsd)
{
  GPIO_InitTypeDef gpio_init_structure;

  if(hsd == &hsd_sdmmc[0])
  {
    /* Disable NVIC for SDIO interrupts */
    HAL_NVIC_DisableIRQ(SDMMC1_IRQn);

    /* GPIOC configuration */
    gpio_init_structure.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
    HAL_GPIO_DeInit(GPIOC, gpio_init_structure.Pin);

    /* GPIOD configuration */
    gpio_init_structure.Pin = GPIO_PIN_2;
    HAL_GPIO_DeInit(GPIOD, gpio_init_structure.Pin);

    /* Disable SDMMC1 clock */
    __HAL_RCC_SDMMC1_CLK_DISABLE();
  }
  else if(hsd == &hsd_sdmmc[1])
  {
    /* Disable NVIC for SDIO interrupts */
    HAL_NVIC_DisableIRQ(SDMMC2_IRQn);

    /* GPIOG configuration */
    gpio_init_structure.Pin = GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
    HAL_GPIO_DeInit(GPIOG, gpio_init_structure.Pin);

    /* GPIOD configuration */
    gpio_init_structure.Pin = GPIO_PIN_6 | GPIO_PIN_7;
    HAL_GPIO_DeInit(GPIOD, gpio_init_structure.Pin);

   /* Disable SDMMC2 clock */
    __HAL_RCC_SDMMC2_CLK_DISABLE();
  }
  else
  {
    /* Do nothing */
  }
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
